---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedOpaque.OpaqueMfp
source: html/a11dd6e0-f889-4863-620b-4844462ea85c.htm
---
# Autodesk.Revit.DB.Visual.AdvancedOpaque.OpaqueMfp Property

The property labeled "Translucency Depth" from the "AdvancedOpaque" schema.

## Syntax (C#)
```csharp
public static string OpaqueMfp { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".